[
  {
    "path": "posts/2021-08-15-project-poster/",
    "title": "Project Poster",
    "description": "Poster for the project work for this course.",
    "author": [
      {
        "name": "Wang Xiyu, Tang Huining",
        "url": "https://scis.smu.edu.sg/"
      }
    ],
    "date": "2021-08-15",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-16T00:09:30+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-15-project-proposal/",
    "title": "Project Proposal",
    "description": "The title of our Project is \"Visual analytics of GPS tracks: From Consumption to Relationship to Suspect Activity\". We aims to get abnormal personal relationships based on the trajectory of all employees’ actions and consumption before the employees disappeared, so as to determine whether these people are related to the missing employees.We also hope to combine the relationship and gps traacks to get abnormal location so that we could estimate if something worth investigate at that place. Our application will inculding 4 parts, in each part we would gradually analyze the caracteristics of consumption and gps track and relationship. We hope to get abnormal location through all interactive graph.",
    "author": [
      {
        "name": "Wang Xiyu, Tang Huining",
        "url": "https://scis.smu.edu.sg/"
      }
    ],
    "date": "2021-08-15",
    "categories": [],
    "contents": "\r\nMotivation\r\nThe driving record of the suspect has always been an important clue to most criminal cases. Through the analysis of the movement of individual people, we can find the suspect’s regular route and regular schedule which is the key in understanding patterns of their movements. Taking the GPS monitoring results of the company’s employees as a whole can help us understand whether the company has organized group activities at a specific time, such as company team building or overtime, which leads to unexpected group behavior. This helps the police find out the suspect’s unusual travel time and destination. As for the credit card and loyalty card consumption records can help us find out whether the suspect has suspiciously large expenditures, and investigate whether it is possible to purchase suspicious items as criminal tools of crime through the location and name of business of the purchased items.\r\nProblem Statement\r\nExplore relations among department, job title, travel time, main travel routes, and spending locations and amounts. Explore spatial and time biases among department and job title, and similarities in traffic pattern and expenditure pattern. Incorporate time series into consideration, build interactive visualizations to present traffic flow and traffic volume. Further investigate the destination of travel and expenditure to derive insights about whether there is suspicious consumer behavior.\r\nSolution\r\nTo reveal the intuitive net work pattern, we will mainly use the ggraph package from R, which provides an flexible extension on the well-acclaimed ggplot2 package in R. In addition to providing the traffic flow between the various landmark nodes in the picture, we will also show the density of traffic, and provide users with visual detailed information through an interactive design.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-15T18:16:30+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-15-project-research-paper/",
    "title": "Project Research Paper",
    "description": "Research paper for the project work for this course.",
    "author": [
      {
        "name": "Wang Xiyu, Tang Huining",
        "url": "https://scis.smu.edu.sg/"
      }
    ],
    "date": "2021-08-15",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nABSTRACT\r\n1. INTRODUCTION AND MOTIVATION\r\n2. OBJECTIVES\r\n3. REVIEW OF PAST WORKS\r\n3.1 Interactive Exploratory Data Analysis\r\n3.2 GeoVisual Analytics\r\n3.3 Association Analysis\r\n\r\n4. DESIGNFRAMEWORK AND USE CASE DEMONSTRATION\r\n4.1 Location & Consumption\r\n4.2 GPS Tracking\r\n4.3 Credit&Loyalty Card Owner\r\n4.4 Relationship\r\n\r\n5. DISCUSSION\r\n5.1 The most popular shops and periods based on credit card and loyalty card data\r\n5.2 Ownerships of credit cards and loyalty cards\r\n5.3 Potential suspicious location, activities and relationship\r\n\r\n6. FUTURE WORK\r\n\r\nABSTRACT\r\nThe VAST 2014 Mini-challenge 2 provided a set of GPS vehicle tracking and credit card transaction data with the aim of inferring behavior of those using the vehicles and credit cards. In particular it required us to design interactive visual analytics system to Identify suspicious activities and suspicious relationships. In this paper we would introduce the approach we use to design interactive graph and our insight.\r\n1. INTRODUCTION AND MOTIVATION\r\nWhen GAStech’s IPO was celebrated in 2014, several employees of the company were strangely missing. Fortunately, Many of the Abila, Kronos-based employees of GAStech have company cars which are approved for both personal and business use. These cars are equipped with GPS tracking devices, which can provide tracking data for two weeks before the disappearance (no data on the day of disappearance). Credit card and loyalty card transactions data are also provided for case investigation. Taking the GPS monitoring results of the company’s employees as a whole can help us understand whether the company has organized group activities at a specific time, such as company team building or overtime, which leads to unexpected group behavior. This helps the police find out the suspect’s unusual travel time and destination. As for the credit card and loyalty card consumption records can help us find out whether the suspect has suspiciously large expenditures, and investigate whether it is possible to purchase suspicious items as criminal tools of crime through the location and name of business of the purchased items.\r\n2. OBJECTIVES\r\nIn this research, we will build an R Shiny application to illustrate the results of current data visualization. The goal is to analyze the trajectory of the company’s employees in the two weeks before the case, to find suspicious activities and suspicious locations, and to analyze the relationship between personnel in depth. Analysis and visualization are mainly divided into five parts. Based on the processed database and request in mini-challenge 2, we will conduct progressive analysis and visual display.\r\nAccording to the shop consumption situation, including the consumption amount and the exact time, explore the general consumption status of the shop, so as to find abnormal consumption situation in the follow-up.\r\nVisualize the trajectory of each vehicle and explore its periodic habits in order to find suspicious locations and relationships with characters.\r\nCombine GPS data and credit card and loyalty card consumption data to visualize the card that each employee is most likely to correspond to. Determine the corresponding relationship between the employee and the card based on the visualization results.\r\nBased on the previous results, explore the relationship between employees.\r\nComprehensive analysis and detailed description of suspicious actions and character relationships.\r\n3. REVIEW OF PAST WORKS\r\nMost of the insights on Mini-challenge 2 use methods such as geographic analysis, path analysis, character path analysis, consumption analysis, and association analysis. The main goal of our research is to analyze suspicious actions and suspicious person relationships, so in addition to the necessary basic analysis, we also need GPS tracking maps and person relationship maps. So that our research are mainly based on the Interactive exploratory data analysis, GeoVisual Analytics and Association Analysis.\r\n3.1 Interactive Exploratory Data Analysis\r\nExploratory Data Analysis is the initial analysis that we perform on the data to understand the data. We are going to use statistical graphics to visualize the results of IEDA. Past work sometimes skipped this part of the analysis and mainly showed the trajectory or the relationship between the characters. However, considering the need to obtain the basic information of people’s card consumption, the visualization of this part is still very necessary. We would use ggplot package to explore the data.\r\n3.2 GeoVisual Analytics\r\nThere is an increasing trend of usage of line plots, geographic maps, heat maps, histograms, and graphs for time series data. Below is the lecture review of several examples of interactive visual analysis available.\r\nRegional map\r\nIt can be used to analyze data by region, reflecting the basic natural and economic conditions and regional characteristics of a certain region.\r\nHeatmap\r\nThe heatmap is used to convert data into color tones within the geographic coordinate system, and intuitively reflect the distribution, frequency or density of the data in the geographic space through the degree of color change.\r\nBubble Map\r\nBubble map is a very common visualization map related to geographic location information. It can transmit multidimensional information at the same time. The location of the bubble is used to transmit physical location information.\r\nTrajectory graph\r\nDifferent lines can be identified by different colors, and the size of the line thickness is used to indicate the size of the passenger flow or the times the person pass this area.\r\n3.3 Association Analysis\r\nSince we would like to know the relationship between the employees, we would like to use network diagram to show whether employees are intimate or not. Then we could collaborate with gps data and find out when they go out together. We would explore with visNetwork package.\r\n4. DESIGNFRAMEWORK AND USE CASE DEMONSTRATION\r\nOn the left of the interface, we provide a navigation header that enables users to select the part they would like to explore. The four areas are Location & Consumption, GPS Tracking, Credit&Loyalty Card Owner and Relationship.\r\n4.1 Location & Consumption\r\nIn this section, three selection buttons are provided at the top left. The user can select a credit card or a membership card to get a frequency histogram and a scatter plot of consumption amount. Users can also select all of them and compare the differences between membership cards and credit cards. A drop-down menu is provided on the upper right, and the user can select one of the stores and will get a heat map about the time and the number of consumption.\r\n4.2 GPS Tracking\r\nThis part shows the daily trajectory of each employee. The drop-down menu on the left side of the interface can select the employee’s name and date. After selection, a graph of the employee’s action trajectory on the day will appear.\r\n4.3 Credit&Loyalty Card Owner\r\n4.3.1 Determine the GPS of the store\r\nAfter many discussions, we agreed that the most effective way is to confirm the GPS of the designated store by comparing the individual’s driving trajectory on a designated number of days and the coordinates shown on the map. As shown in the figure below, the GPS data of the employee during this day showed that he stayed at about three locations outside the company. By comparing the staying location with the store location shown on the map, we can roughly get the estimated location of the store. After many comparisons, we found the home addresses of most shops and employees.\r\n4.3.2 Data Process\r\nBecause we want to explore the card number corresponding to the vehicle id, we first process the data and then make the map. First, we associate the shop gps data and the consumption data of the two cards respectively. Secondly, these data are associated with the GPS data of the vehicle and the distance is calculated. Filter the data with a distance of no more than 10m to obtain a one-to-one correspondence with the card number and employee name. We can think that the card number with the most occurrence probability is the owner’s card.\r\n4.3.3 Interface\r\nTwo parts are displayed on this interface. On the left is the membership card and credit card number used by the employee after data processing. A drop-down menu is provided on the right, and the user can select the employee’s name. After selection, a histogram of possible card numbers and corresponding times corresponding to the employee will appear.\r\n4.4 Relationship\r\n4.4.1 Data Process\r\nBecause only credit card data is accurate to the minute, we only use credit card data for comparison. Correlate the consumption data of different people through locations to obtain non-personal pairs. If the difference in consumption time between two people is within ten minutes, we assume that they are related.\r\n4.4.2 Interface\r\nA drop-down menu is provided at the top left of the interface, where you can select a person’s name. After selecting, you can see the character relationship network diagram on the right. In order to facilitate the observation of the relationship between employees, we set the nodes to different colors according to the type of employee employment. The left side contains the label of the type of color.\r\n5. DISCUSSION\r\n5.1 The most popular shops and periods based on credit card and loyalty card data\r\n\r\nAs can be seen from the bar charts above, there are four shops that are obviously more popular compared with merchants: Katerina’s Cafe, Hippokampos, Guy’s Gyros and Brew’ve Been Served. Judging from the scatter plot of the transaction volume of each store, the overall consumption is relatively even. Among these stores, the transaction data of a few stores is more prominent, but none of them has a single transaction exceeding 5000 dollars. However, there is indeed an extreme outlier appeared in Frydos Autosupply n’ More, with a single transaction amount of 10,000, which is likely to be the behavior of the suspect.\r\nAlso, Through the observation of the overall heatmap, it can be presumably inferred that the merchants’ business hours are 7-21 o’clock on weekdays and 12-20 o’clock on weekends, of which 7 o’clock, 12-13 o’clock and 20 o’clock are the morning, middle and evening peak hours of the day. Therefore, visits during non-business hours can be tentatively regarded as abnormal situations worthy of the police’s attention.\r\n5.2 Ownerships of credit cards and loyalty cards\r\nBecause both the consumption data of the cards and the driving record data have timestamp variable, we can use the same time variables in these two tables to identify which vehicles stayed at a specific merchant at a specific time. And then find the corresponding consumers through the vehicle assignment data table, so that we can generate a list including all associations of card numbers and consumers. The combinations that appear frequently in multiple lists, that is, the association with the highest frequency, can be preliminarily determined as the ownership between the card and the consumer.\r\nHowever, this method will have some limitations, because we use the dispatching relationship of the car as a medium to determine the relationship between the cards and the consumers. In fact, unexpected situations are likely to occur, for example, people use cards other than their own to make a transaction, or someone drives someone else’s car to spend at the merchant. {width=60%}\r\n5.3 Potential suspicious location, activities and relationship\r\nWe can use timestamp and location indicator of transaction data to group card numbers to find out which cards are used for consumption at the same merchant at the same time.Through this result, we can utilize the result of the previous question to find the owners of the cards in a one-to-one correspondence. People in the same timestamp-location group may have had contact, which enables the police to infer potential relationships.\r\n5.3.1 Analyze suspicious stores based on heat maps\r\n\r\nWe first categorized these stores briefly, and the background colors of the categories represent whether people often visit these stores. Red is the location of the company, which is the most frequented. Orange is a store that people visit more often, and blue is a location that people visit less frequently. The grey shops are those with no signs on the map, and we have not found their exact location.\r\nAfter analyzing the heat map of each store, the business hours of most stores are very regular. As shown in the figure, there is a peak at a fixed time.\r\nHowever, some of them are open late at night. The most suspicious is the Kronos Mart.\r\nMost of the business hours shown in the figure are concentrated in the early morning and morning. Although the possibility that the store will be open 24 hours a day is not ruled out, there are no orders in the afternoon and evening, which are the peak hours of other stores. Overall, Kronos Mart is one of the suspected locations.\r\n5.3.2 Analyze suspicious place based on activities\r\nAfter observing the staff’s daily action route, we found that most of the staff’s whereabouts are very regular during workdays, such as leaving home every morning and going for a walk in the park at night. Since most employees go to work in the morning, they usually do not go out at midnight and early morning. We have made statistics on the actions taken during these periods of time.\r\n\r\nBased on the strange time of activities and the location where these activities happen, we found two suspicious locations with fixed locations and three locations with only latitude and longitude. We consider these five locations to be suspicious. At the same time, these employees are also somewhat suspicious.\r\nThe suspicious employees are as follow.\r\n\r\nWe could see there are totally two employment type and 4 of suspicious employees are the same type.\r\n5.3.3 Analyze suspicious relationship\r\nAs we analyze where people live, we found some of them live together or in the same building. This is a base of further analyze. It is not strange if they usually meet.\r\n\r\nAccording to the character relationship network diagram we have made, it is generally believed that if the character relationship is too complicated or there are too many contacts with people from other departments, then the character relationship can be considered as possible. Below is the character relationship diagram of five suspicious characters. We can see that their character relationships are usually very complicated. If we need to study suspicious relationships, we can first look for clues from their network of relationships.\r\n\r\n6. FUTURE WORK\r\nWe hope that in the future, we can add the specific business hours data of each store or the guess about the business hours of the stores obtained from session one into the session two, and combine it with the original gps data, so that mark the suspect’s patronage during business hours as black on the map, and the patronage during non-business hours as red.\r\nAlso, we did not find the exact standard for suspicious characters. First of all, the standard for judging is single, and we cannot directly infer that the relationship is suspicious. Secondly, if people take improper actions, they may try to avoid meeting in daily life, which makes judgments more difficult. We hope to find better ways to infer suspicious relationships between characters in the future.\r\nIn addition, we also hope that in the future we will be able to make the suspect’s driving path diagram dynamic, so that when we select several target suspects, we can simulate their action trajectory through dynamic points that represent their real-time positions, and see their intersection more intuitively.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-08-15-project-research-paper/pic/Picture14.png",
    "last_modified": "2021-08-16T01:08:49+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-15-project-shiny-application/",
    "title": "Project Shiny Application",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Wang Xiyu, Tang Huining",
        "url": "https://scis.smu.edu.sg/"
      }
    ],
    "date": "2021-08-15",
    "categories": [],
    "contents": "\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-15T00:37:51+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-15-project-submission-mini-challenge-2/",
    "title": "Project Submission Mini-Challenge 2",
    "description": "Submission for the project work for this course.",
    "author": [
      {
        "name": "Wang Xiyu, Tang Huining",
        "url": "https://scis.smu.edu.sg/"
      }
    ],
    "date": "2021-08-15",
    "categories": [],
    "contents": "\r\nProject Submission\r\nProject Proposal\r\nProject Poster\r\nShiny Application\r\nUser Guide for the Shiny Application\r\nProject Research Paper\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-15T18:14:32+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-15-project-user-guide/",
    "title": "Project User Guide",
    "description": "User Guide for the Shiny application.",
    "author": [
      {
        "name": "Wang Xiyu, Tang Huining",
        "url": "https://scis.smu.edu.sg/"
      }
    ],
    "date": "2021-08-15",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nUser Guide\r\n1. Location & Consumption\r\n2. GPS Tracking\r\n3. Credit & Loyalty Card Ownership\r\n\r\n\r\nUser Guide\r\nThis document gives a short description of our R Shiny Application and an overview of the application layout.\r\n1. Location & Consumption\r\nThe interface of the first session is divided into two parts. The two graphs on the left-hand side are a bar graph showing the frequency of purchases in each store and a scatter plot showing every single transaction amount in each store. At the upper left corner of the panel, user can select credit card, loyalty card, or both showing at the same time.\r\n\r\nAs for the mosaic chart on the right-hand side, users can select the store name in the drop-down list at the top of the panel, or select ‘all’, so that to show the patronized situation all shops as a whole.\r\n\r\n2. GPS Tracking\r\nThe graph in the lower left corner shows all the driving path records in the two weeks before the incident, in which the thickness of the red line greatly reflects the popularity of the places. After selecting the suspect’s name and his/her travel date in the upper left corner of the interface, user can see that the map on the right will change accordingly.\r\n\r\n3. Credit & Loyalty Card Ownership\r\nUtilizing the time variables of transaction data and gps data to identify which vehicles stayed at a specific merchant at a specific time, we can generate a list including all associations of card numbers and consumers. The combinations that appear frequently in multiple lists, that is, the association with the highest frequency, can be preliminarily determined as the ownership between the card and the consumer.\r\nAt the top of the panel on the right, users can select the name of the suspect, and the bar chart below can correspondingly display the cards that may be identified as the suspect’s and their corresponding frequency.\r\n\r\n\r\nThe left side of the interface displays the complete list of employees, the end numbers of membership cards and credit cards that most likely to be determined as their cards, and the frequency of the association appearing.\r\n\r\nThe dropdown list in the upper left corner enables the users to select the name of the suspect to be investigated. After selecting the target task, you can see that the personnel nodes and connections in the relationship network diagram that have nothing to do with the personnel will be grayed out, and only those with potential relationships will be remained.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-16T00:31:55+08:00",
    "input_file": {}
  }
]
